Tekla.Structures.Drawing.CurvedDimensionSetBase.CurvedDimensionSetBaseAttributes
The CurvedDimensionSetBaseAttributes class contains the attributes for the curved dimensions.

Tekla.Structures.Drawing.CurvedDimensionSetBase.CurvedDimensionSetBaseAttributes.#ctor
Creates a new curved dimension set base attributes instance which loads standard attributes.

Tekla.Structures.Drawing.CurvedDimensionSetBase.CurvedDimensionSetBaseAttributes.#ctor(System.Boolean)
Creates a new curved dimension set base attributes instance which loads standard attributes.
SkipLoadingAttributes: If it set to true attributes won't be lodaded.

Tekla.Structures.Drawing.CurvedDimensionSetBase.CurvedDimensionSetBaseAttributes.#ctor(System.String)
Creates a new curved dimension set base attributes instance that loads the specified attributes.
AttributesFile: The attributes file's filename.